src/config/Documents/РеестрПечатныхФормДляПередачиВОфис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеестрПечатныхФормДляПередачиВОфис</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаДок</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаданиеНаОтгрузку</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПечатнойФормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПечатныхФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостояниеДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местонахождение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/InformationRegisters/ПечатныеФормыВНаличии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПечатныеФормыВНаличии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВПути</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПечатнойФормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Documents/РеестрПечатныхФормДляПередачиВОфис/Ext/ObjectModule.bsl
Процедура Печать() Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеестрПечатныхФормДляПередачиВОфис.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	область.Параметры.Заполнить(ЭтотОбъект);
	Область.параметры.Дата = Формат(Дата,"ДЛФ=DD");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	Шапка.параметры.ДатаОтправки = Формат(ДатаОтправки,"ДЛФ=DD");
	ТабДок.Вывести(Шапка);
	// Реестр
	Область = Макет.ПолучитьОбласть("РеестрШапка");
	ТабДок.Вывести(Область);
	ОбластьРеестр = Макет.ПолучитьОбласть("Реестр");
	Для Каждого ТекСтрокаРеестр Из Реестр Цикл
		ОбластьРеестр.Параметры.Заполнить(ТекСтрокаРеестр);
		КонтрагентНаименование = "";
		Если НЕ ТипЗнч(ТекСтрокаРеестр.СсылкаДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			КонтрагентНаименование = ТекСтрокаРеестр.СсылкаДок.Контрагент;
		Иначе
           Если НЕ ТекСтрокаРеестр.СсылкаДок.Пустая() Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ПеремещениеТоваров.ВнутреннийЗаказ.ДокументОснование.Контрагент.Наименование КАК КонтрагентНаименование
				|ИЗ
				|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				|ГДЕ
				|	ПеремещениеТоваров.Ссылка = &ДокПеремещение";
				
				Запрос.УстановитьПараметр("ДокПеремещение", ТекСтрокаРеестр.СсылкаДок);
				Результат = Запрос.Выполнить();
				Если НЕ Результат.Пустой() Тогда
					Выборка = Результат.Выбрать();
					Выборка.Следующий();
					КонтрагентНаименование = Выборка.КонтрагентНаименование;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ОбластьРеестр.Параметры.Контрагент = КонтрагентНаименование;
		ТабДок.Вывести(ОбластьРеестр);
	КонецЦикла;

	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецПроцедуры


Процедура ПечатьПоменеджерам() Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеестрПечатныхФормДляПередачиВОфис.ПолучитьМакет("Поменеджерам");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	область.Параметры.Заполнить(ЭтотОбъект);
	Область.параметры.Дата = Формат(Дата,"ДЛФ=DD");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	Шапка.параметры.ДатаОтправки = Формат(ДатаОтправки,"ДЛФ=DD");
	ТабДок.Вывести(Шапка);
	// Реестр
	Область = Макет.ПолучитьОбласть("РеестрШапка");
	ТабДок.Вывести(Область);
	
	Табл = Реестр.Выгрузить();
	Табл.Колонки.Добавить("Менеджер");
	
	Для каждого стр из Табл Цикл
		попытка
		стр.менеджер = стр.СсылкаДок.ДоговорКонтрагента.ОтветственноеЛицо;
	    исключение
		конецпопытки;
	конецЦикла;
	
	Табл.Сортировать("Менеджер");
	текущийМенеджер = "";
	ОбластьМенеджер = Макет.ПолучитьОбласть("Менеджер");
	ОбластьРеестр = Макет.ПолучитьОбласть("Реестр");
	Для Каждого ТекСтрокаРеестр Из Табл Цикл
		Если  ТекСтрокаРеестр.Менеджер <> Текущийменеджер Тогда
			Областьменеджер.параметры.менеджер = ТекСтрокаРеестр.Менеджер;
			Областьменеджер.параметры.количество = Табл.НайтиСтроки(новый структура("менеджер",ТекСтрокаРеестр.Менеджер)).Количество();
			ТабДок.Вывести(ОбластьМенеджер);
       конецесли;
		текущийМенеджер = ТекСтрокаРеестр.Менеджер;	
		ОбластьРеестр.Параметры.Заполнить(ТекСтрокаРеестр);
		ОбластьРеестр.Параметры.Контрагент = ТекСтрокаРеестр.СсылкаДок.Контрагент;
		ТабДок.Вывести(ОбластьРеестр);
	КонецЦикла;

	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры




Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	    Если не ЗначениеЗаполнено(ДатаОтправки)и не ЗначениеЗаполнено(Должность) и (не значениеЗаполнено(Водитель) и не значениеЗаполнено(Перевозчик) )тогда
		Сообщить("Заполните данные по отправке документов!");
		Отказ =Истина;
		конецЕсли;	
	    Передан = Истина;
		Записать();
	//проставляем отметку в пути
	Для Каждого Строка Из Реестр Цикл
		Если НЕ Строка.Статус = Справочники.СостояниеДокументов.Дубль Тогда
			НаборЗаписей = РегистрыСведений.ПечатныеФормыВНаличии.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Строка.ссылкаДок);
			НаборЗаписей.отбор.видПечатнойФормы.Установить(Строка.ВидПечатнойформы);
			НаборЗаписей.Прочитать(); 
			НаборЗаписей[0].ВПути = Истина;
			НаборЗаписей[0].ДатаПеремещения = НачалоДня(ТекущаяДата());
	        НаборЗаписей[0].Должность = Должность;
			НаборЗаписей.Записать();		
		КонецЕсли;
    КонецЦикла;
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		//УстановитьНомерДокумента(ЭтотОбъект);
		Если Этоновый() Тогда
			Ответственный =  глТекущийПользователь;
		конецЕсли;
			Если не Отказ Тогда   
		Если сокрЛП(номер)="" Тогда
			СтрокаПрефикс = "ТК";
			Если подразделение.ПрефиксИБ<>"" Тогда
				СтрокаПрефикс = подразделение.ПрефиксИБ;
			КонецЕсли;	
			ЭтотОбъект.УстановитьНовыйНомер(СтрокаПрефикс);	
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
			Префикс = "ТК";
			Если подразделение.ПрефиксИБ<>"" Тогда
				Префикс = подразделение.ПрефиксИБ;
			КонецЕсли;	
КонецПроцедуры
